app/Controllers/Auth.php

    public function doLogin()
    {
        // Ambil inputan email dan password
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cek apakah email dan password cocok dengan data di database
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'nanda@gmail.com'
 LIMIT 1