app/Controllers/Bids.php

    public function create($itemId)
    {
        // Ambil user_id yang sedang login
        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Anda harus login untuk melakukan bid.');
        }

        // Ambil model Bid dan Item
        $bidModel = new BidModel();
        $itemModel = new ItemModel();

        // Ambil data item berdasarkan ID
        $item = $itemModel->find($itemId);

        // Pastikan item ada
        if (!$item) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Item tidak ditemukan.');
        }

        // Periksa apakah user adalah pembuat item
        if ($item['created_by'] == $userId) {
            return redirect()->back()->with('error', 'Anda tidak dapat melakukan bid pada item yang Anda buat.');
        }

        // Ambil bid tertinggi untuk item tersebut
        $highestBid = $bidModel->where('item_id', $itemId)
                               ->orderBy('bid_amount', 'DESC')
                               ->first();
---
SELECT *
FROM `items`
WHERE `items`.`id` = '42'
SELECT *
FROM `bids`
WHERE `item_id` = '42'
ORDER BY `bid_amount` DESC
 LIMIT 1

                             ->with('error', 'Bid Anda harus lebih tinggi dari harga saat ini.');
        }

        $existingBid = $bidModel->where('item_id', $itemId)
                                ->where('user_id', $userId)
                                ->first();
---
SELECT *
FROM `bids`
WHERE `item_id` = '42'
AND `user_id` = '4'
 LIMIT 1

                'bid_amount'  => $bidAmount,
            ];

            if ($bidModel->save($data)) {
---
INSERT INTO `bids` (`item_id`, `user_id`, `bid_amount`, `created_at`, `updated_at`) VALUES ('42', '4', '50010', '2024-12-03 08:23:04', '2024-12-03 08:23:04')