app/Controllers/Lelang.php

SELECT *
FROM `items`
---
    public function index()
    {
        $this->processExpiredItems();

        $itemModel = new ItemModel();
        $bidModel = new BidModel();

        // Ambil semua barang lelang
        $items = $itemModel->findAll();

SELECT *
FROM `items`
WHERE `items`.`id` = '42'
---
    public function view($id)
    {
        $userId = session()->get('user_id'); // Ambil user_id dari session
            if (!$userId) {
                // Redirect ke halaman login jika belum login
                return redirect()->to('/login');
            }
        $itemModel = new ItemModel();
        $transactionModel = new TransactionModel();
        $bidModel = new BidModel();

        // Perbarui status item sebelum mengambil data
        //$itemModel->updateStatus();

        // Mengambil data item
        $item = $itemModel->find($id);

SELECT *
FROM `items`
WHERE `end_time` < '2024-12-03 08:25:40'
AND `status` = 'active'
SELECT *
FROM `bids`
WHERE `item_id` = '42'
ORDER BY `bid_amount` DESC
 LIMIT 1
INSERT INTO `transactions` (`user_id`, `item_id`, `final_price`, `status`, `created_at`, `updated_at`) VALUES ('4', '42', '50010.00', 'pending', '2024-12-03 08:25:40', '2024-12-03 08:25:40')
UPDATE `items` SET `status` = 'closed', `updated_at` = '2024-12-03 08:25:40'
WHERE `items`.`id` IN ('42')
---
    private function processExpiredItems()
    {
        $itemModel = new ItemModel();
        $bidModel = new BidModel();
        $transactionModel = new TransactionModel();

        // Ambil semua item aktif yang sudah lewat waktu end_time
        $expiredItems = $itemModel->where('end_time <', date('Y-m-d H:i:s'))
                                ->where('status', 'active')
                                ->findAll();

        foreach ($expiredItems as $item) {
            // Ambil bid tertinggi untuk item tersebut
            $highestBid = $bidModel->where('item_id', $item['id'])
                                ->orderBy('bid_amount', 'DESC')
                                ->first();

            if ($highestBid) {
                // Jika ada bid tertinggi, buat transaksi baru
                $transactionData = [
                    'user_id' => $highestBid['user_id'],
                    'item_id' => $item['id'],
                    'final_price' => $highestBid['bid_amount'],
                    'status' => 'pending',
                    'created_at' => date('Y-m-d H:i:s'),
                    'updated_at' => date('Y-m-d H:i:s'),
                ];
                $transactionModel->save($transactionData);
            }

            // Perbarui status item menjadi 'closed'
            $itemModel->update($item['id'], ['status' => 'closed']);