app/Controllers/Payment.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT *
FROM `payments`
WHERE `transaction_id` = '41'
 LIMIT 1
---
    public function choose($itemId)
    {
        $paymentModel = new \App\Models\PaymentModel();
        $userModel = new \App\Models\UserModel(); // Pastikan model ini tersedia
        $userId = session()->get('user_id');

        // Ambil data user
        $user = $userModel->find($userId);

        // Cari payment untuk transaksi terkait
        $payment = $paymentModel->where('transaction_id', $itemId)->first();

SELECT *
FROM `transactions`
WHERE `item_id` = '41'
 LIMIT 1
---
    public function process($itemId)
    {
        $paymentModel = new PaymentModel();
        $transactionModel = new TransactionModel();

        // Ambil metode pembayaran dari form
        $paymentMethod = $this->request->getPost('payment_method');
        $amount = 100000; // Contoh nominal
        $uniqueCode = rand(100, 999); // Kode unik untuk transfer bank

        // Mapping metode pembayaran sesuai enum
        switch ($paymentMethod) {
            case 'transfer':
                $method = 'bank_transfer';
                break;
            case 'cod':
                $method = 'cash';
                break;
            case 'debit':
                $method = 'credit_card';
                break;
            default:
                return redirect()->back()->with('error', 'Metode pembayaran tidak valid.');
        }

        // Ambil data transaksi terkait
        $transaction = $transactionModel->where('item_id', $itemId)->first();

SELECT *
FROM `payments`
WHERE `transaction_id` = '22'
 LIMIT 1
---
        }

        // Cek apakah pembayaran sudah ada untuk transaksi ini
        $existingPayment = $paymentModel->where('transaction_id', $transaction['id'])->first();

INSERT INTO `payments` (`transaction_id`, `amount`, `payment_date`, `payment_method`, `status`, `created_at`, `updated_at`) VALUES ('22', '50020.00', '2024-12-03 08:25:35', 'cash', 'completed', '2024-12-03 08:25:35', '2024-12-03 08:25:35')
---
                'updated_at' => date('Y-m-d H:i:s'),
            ];

            if (!$paymentModel->save($paymentData)) {

SELECT *
FROM `payments`
WHERE `transaction_id` = '22'
 LIMIT 1
---
    public function status($transactionId)
    {
        $paymentModel = new PaymentModel();
        $payment = $paymentModel->where('transaction_id', $transactionId)->first();