app/Controllers/Products.php

    public function index()
    {
        $userId = session()->get('user_id'); // Ambil user_id dari session
        //var_dump(session()->get());
        if (!$userId) {
            // Redirect ke halaman login jika belum login
            return redirect()->to('/login');
        }
        //var_dump($userId);
        $itemModel = new ItemModel();
        $items = $itemModel->findAll();  // Ambil semua data produk
---
SELECT *
FROM `items`