app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function index()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find($userId);

SELECT *
FROM `transactions`
WHERE `user_id` = '4'
---
    public function history()
    {
        //processExpiredItems();
        $userId = session()->get('user_id'); // Ambil user_id dari session
        if (!$userId) {
            return redirect()->to('/login');
        }

        $transactionModel = new TransactionModel();

        // Ambil history transaksi berdasarkan user_id
        $transactions = $transactionModel->where('user_id', $userId)
                                          ->findAll();

SELECT *
FROM `transactions`
WHERE `item_id` = '41'
AND `user_id` = '4'
 LIMIT 1
SELECT *
FROM `items`
WHERE `items`.`id` = '41'
SELECT *
FROM `payments`
WHERE `transaction_id` = '22'
 LIMIT 1
---
    public function itemDetail($itemId)
    {
        $userId = session()->get('user_id'); // Ambil user_id dari session
        if (!$userId) {
            return redirect()->to('/login');
        }

        $transactionModel = new TransactionModel();
        $itemModel = new ItemModel();
        $paymentModel = new PaymentModel();

        // Ambil transaksi berdasarkan item_id dan user_id
        $transaction = $transactionModel->where([
            'item_id' => $itemId,
            'user_id' => $userId
        ])->first();

        if (!$transaction) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Transaction not found');
        }

        // Ambil data item
        $item = $itemModel->find($itemId);
        if (!$item) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Item not found');
        }

        // Ambil status pembayaran
        $payment = $paymentModel->where('transaction_id', $transaction['id'])->first();