app/Models/BidModel.php

SELECT *
FROM `bids`
WHERE `item_id` = '1'
ORDER BY `bid_amount` DESC
 LIMIT 1
---
    public function getHighestBid($itemId)
    {
        return $this->where('item_id', $itemId)
                    ->orderBy('bid_amount', 'DESC')
                    ->first();